import pytest

from numeral_converter import int2numeral

# Auto collected from https://www.kyivdictionary.com/uk/words/number-spelling


def test_unknown():
    with pytest.raises(ValueError):
        int2numeral(10**100, case="nominative", num_class="quantitative")


def test_wrong_form():
    with pytest.warns(UserWarning):
        int2numeral(200, num_class="collective")


def test_morph_forms():
    assert (
        int2numeral(666777888999, case="nominative", num_class="quantitative")
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ять"
    )

    assert (
        int2numeral(666777888999, case="genetive", num_class="quantitative")
        == "шестисот шістдесяти (шістдесятьох) шести (шістьох) мільярдів семисот "
        "сімдесяти (сімдесятьох) семи (сімох) мільйонів восьмисот вісімдесяти "
        "(вісімдесятьох) восьми (вісьмох) тисяч дев’ятисот дев’яноста дев’яти "
        "(дев’ятьох)"
    )

    assert (
        int2numeral(666777888999, case="dative", num_class="quantitative")
        == "шестистам шістдесяти (шістдесятьом) шести (шістьом) мільярдам семистам "
        "сімдесяти (сімдесятьом) семи (сімом) мільйонам восьмистам вісімдесяти "
        "(вісімдесятьом) восьми (вісьмом) тисячам дев’ятистам дев’яноста "
        "дев’яти (дев’ятьом)"
    )

    assert (
        int2numeral(666777888999, case="accusative", num_class="quantitative")
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ять (дев’ятьох)"
    )

    assert (
        int2numeral(666777888999, case="instrumental", num_class="quantitative")
        == "шістьмастами (шістьомастами) шістдесятьма (шістдесятьома) шістьма "
        "(шістьома) мільярдами сьомастами (сімомастами) сімдесятьма (сімдесятьома) "
        "сімома (сьома) мільйонами вісьмастами (вісьмомастами) вісімдесятьма "
        "(вісімдесятьома) вісьма (вісьмома) тисячами дев’ятьмастами "
        "(дев’ятьомастами) дев’яноста дев’ятьма (дев’ятьома)"
    )

    assert (
        int2numeral(666777888999, case="prepositional", num_class="quantitative")
        == "шестистах шістдесяти (шістдесятьох) шести (шістьох) мільярдах семистах "
        "сімдесяти (сімдесятьох) семи (сімох) мільйонах восьмистах вісімдесяти "
        "(вісімдесятьох) восьми (вісьмох) тисячах дев’ятистах дев’яноста дев’яти "
        "(дев’ятьох)"
    )

    assert (
        int2numeral(
            666777888999,
            case="nominative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятий"
    )

    assert (
        int2numeral(
            666777888999,
            case="nominative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ята"
    )

    assert (
        int2numeral(
            666777888999,
            case="nominative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’яте"
    )

    assert (
        int2numeral(
            666777888999, case="nominative", num_class="ordinal", number="plural"
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’яті"
    )

    assert (
        int2numeral(
            666777888999,
            case="genetive",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятого"
    )

    assert (
        int2numeral(
            666777888999,
            case="genetive",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятої"
    )

    assert (
        int2numeral(
            666777888999,
            case="genetive",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятого"
    )

    assert (
        int2numeral(666777888999, case="genetive", num_class="ordinal", number="plural")
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятих"
    )

    assert (
        int2numeral(
            666777888999,
            case="dative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятому"
    )

    assert (
        int2numeral(
            666777888999,
            case="dative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятій"
    )

    assert (
        int2numeral(
            666777888999,
            case="dative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятому"
    )

    assert (
        int2numeral(666777888999, case="dative", num_class="ordinal", number="plural")
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятим"
    )

    assert (
        int2numeral(
            666777888999,
            case="accusative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятий (дев’ятого)"
    )

    assert (
        int2numeral(
            666777888999,
            case="accusative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’яту"
    )

    assert (
        int2numeral(
            666777888999,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’яте"
    )

    assert (
        int2numeral(
            666777888999, case="accusative", num_class="ordinal", number="plural"
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’яті (дев’ятих)"
    )

    assert (
        int2numeral(
            666777888999,
            case="instrumental",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятим"
    )

    assert (
        int2numeral(
            666777888999,
            case="instrumental",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятою"
    )

    assert (
        int2numeral(
            666777888999,
            case="instrumental",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятим"
    )

    assert (
        int2numeral(
            666777888999, case="instrumental", num_class="ordinal", number="plural"
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятими"
    )

    assert (
        int2numeral(
            666777888999,
            case="prepositional",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятому (дев’ятім)"
    )

    assert (
        int2numeral(
            666777888999,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятій"
    )

    assert (
        int2numeral(
            666777888999,
            case="prepositional",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятому (дев’ятім)"
    )

    assert (
        int2numeral(
            666777888999, case="prepositional", num_class="ordinal", number="plural"
        )
        == "шістсот шістдесят шість мільярдів сімсот сімдесят сім мільйонів вісімсот "
        "вісімдесят вісім тисяч дев’ятсот дев’яносто дев’ятих"
    )

    assert (
        int2numeral(221222333444555, case="nominative", num_class="quantitative")
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста тридцять "
        "три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ять"
    )

    assert (
        int2numeral(221222333444555, case="genetive", num_class="quantitative")
        == "двохсот двадцяти (двадцятьох) одного трильйона двохсот двадцяти "
        "(двадцятьох) двох мільярдів трьохсот тридцяти (тридцятьох) трьох мільйонів "
        "чотирьохсот сорока чотирьох тисяч п’ятисот п’ятдесяти (п’ятдесятьох) "
        "п’яти (п’ятьох)"
    )

    assert (
        int2numeral(221222333444555, case="dative", num_class="quantitative")
        == "двомстам двадцяти (двадцятьом) одному трильйону (трильйонові) двомстам "
        "двадцяти (двадцятьом) двом мільярдам трьомстам тридцяти (тридцятьом) "
        "трьом мільйонам чотирьомстам сорока чотирьом тисячам п’ятистам п’ятдесяти "
        "(п’ятдесятьом) п’яти (п’ятьом)"
    )

    assert (
        int2numeral(221222333444555, case="accusative", num_class="quantitative")
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста тридцять "
        "три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят "
        "(п’ятдесятьох) п’ять (п’ятьох)"
    )

    assert (
        int2numeral(221222333444555, case="instrumental", num_class="quantitative")
        == "двомастами двадцятьма (двадцятьома) одним трильйоном двомастами "
        "двадцятьма (двадцятьома) двома мільярдами трьомастами тридцятьма "
        "(тридцятьома) трьома мільйонами чотирмастами сорока чотирма тисячами "
        "п’ятьмастами (п’ятьомастами) п’ятдесятьма (п’ятдесятьома) п’ятьма (п’ятьома)"
    )

    assert (
        int2numeral(221222333444555, case="prepositional", num_class="quantitative")
        == "двохстах двадцяти (двадцятьох) одному (однім) трильйоні двохстах двадцяти "
        "(двадцятьох) двох мільярдах трьохстах тридцяти (тридцятьох) трьох "
        "мільйонах чотирьохстах сорока чотирьох тисячах п’ятистах п’ятдесяти "
        "(п’ятдесятьох) п’яти (п’ятьох)"
    )

    assert (
        int2numeral(
            221222333444555,
            case="nominative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятий"
    )

    assert (
        int2numeral(
            221222333444555,
            case="nominative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ята"
    )

    assert (
        int2numeral(
            221222333444555,
            case="nominative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’яте"
    )

    assert (
        int2numeral(
            221222333444555, case="nominative", num_class="ordinal", number="plural"
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’яті"
    )

    assert (
        int2numeral(
            221222333444555,
            case="genetive",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятого"
    )

    assert (
        int2numeral(
            221222333444555,
            case="genetive",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятої"
    )

    assert (
        int2numeral(
            221222333444555,
            case="genetive",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятого"
    )

    assert (
        int2numeral(
            221222333444555, case="genetive", num_class="ordinal", number="plural"
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятих"
    )

    assert (
        int2numeral(
            221222333444555,
            case="dative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятому"
    )

    assert (
        int2numeral(
            221222333444555,
            case="dative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятій"
    )

    assert (
        int2numeral(
            221222333444555,
            case="dative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятому"
    )

    assert (
        int2numeral(
            221222333444555, case="dative", num_class="ordinal", number="plural"
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятим"
    )

    assert (
        int2numeral(
            221222333444555,
            case="accusative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят "
        "п’ятий (п’ятого)"
    )

    assert (
        int2numeral(
            221222333444555,
            case="accusative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’яту"
    )

    assert (
        int2numeral(
            221222333444555,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’яте"
    )

    assert (
        int2numeral(
            221222333444555, case="accusative", num_class="ordinal", number="plural"
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят "
        "п’яті (п’ятих)"
    )

    assert (
        int2numeral(
            221222333444555,
            case="instrumental",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятим"
    )

    assert (
        int2numeral(
            221222333444555,
            case="instrumental",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятою"
    )

    assert (
        int2numeral(
            221222333444555,
            case="instrumental",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятим"
    )

    assert (
        int2numeral(
            221222333444555, case="instrumental", num_class="ordinal", number="plural"
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятими"
    )

    assert (
        int2numeral(
            221222333444555,
            case="prepositional",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят "
        "п’ятому (п’ятім)"
    )

    assert (
        int2numeral(
            221222333444555,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятій"
    )

    assert (
        int2numeral(
            221222333444555,
            case="prepositional",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят "
        "п’ятому (п’ятім)"
    )

    assert (
        int2numeral(
            221222333444555, case="prepositional", num_class="ordinal", number="plural"
        )
        == "двісті двадцять один трильйон двісті двадцять два мільярди триста "
        "тридцять три мільйони чотириста сорок чотири тисячі п’ятсот п’ятдесят п’ятих"
    )

    assert (
        int2numeral(111212313415515, case="nominative", num_class="quantitative")
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцять"
    )

    assert (
        int2numeral(111212313415515, case="genetive", num_class="quantitative")
        == "ста одинадцяти (одинадцятьох) трильйонів двохсот дванадцяти (дванадцятьох) "
        "мільярдів трьохсот тринадцяти (тринадцятьох) мільйонів чотирьохсот "
        "п’ятнадцяти (п’ятнадцятьох) тисяч п’ятисот п’ятнадцяти (п’ятнадцятьох)"
    )

    assert (
        int2numeral(111212313415515, case="dative", num_class="quantitative")
        == "ста одинадцяти (одинадцятьом) трильйонам двомстам дванадцяти "
        "(дванадцятьом) мільярдам трьомстам тринадцяти (тринадцятьом) мільйонам "
        "чотирьомстам п’ятнадцяти (п’ятнадцятьом) тисячам п’ятистам "
        "п’ятнадцяти (п’ятнадцятьом)"
    )

    assert (
        int2numeral(111212313415515, case="accusative", num_class="quantitative")
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцять (п’ятнадцятьох)"
    )

    assert (
        int2numeral(111212313415515, case="instrumental", num_class="quantitative")
        == "ста одинадцятьма (одинадцятьома) трильйонами двомастами дванадцятьма "
        "(дванадцятьома) мільярдами трьомастами тринадцятьма (тринадцятьома) "
        "мільйонами чотирмастами п’ятнадцятьма (п’ятнадцятьома) тисячами "
        "п’ятьмастами (п’ятьомастами) п’ятнадцятьма (п’ятнадцятьома)"
    )

    assert (
        int2numeral(111212313415515, case="prepositional", num_class="quantitative")
        == "ста одинадцяти (одинадцятьох) трильйонах двохстах дванадцяти "
        "(дванадцятьох) мільярдах трьохстах тринадцяти (тринадцятьох) мільйонах "
        "чотирьохстах п’ятнадцяти (п’ятнадцятьох) тисячах п’ятистах п’ятнадцяти "
        "(п’ятнадцятьох)"
    )

    assert (
        int2numeral(
            111212313415515,
            case="nominative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятий"
    )

    assert (
        int2numeral(
            111212313415515,
            case="nominative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцята"
    )

    assert (
        int2numeral(
            111212313415515,
            case="nominative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцяте"
    )

    assert (
        int2numeral(
            111212313415515, case="nominative", num_class="ordinal", number="plural"
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцяті"
    )

    assert (
        int2numeral(
            111212313415515,
            case="genetive",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятого"
    )

    assert (
        int2numeral(
            111212313415515,
            case="genetive",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятої"
    )

    assert (
        int2numeral(
            111212313415515,
            case="genetive",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятого"
    )

    assert (
        int2numeral(
            111212313415515, case="genetive", num_class="ordinal", number="plural"
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятих"
    )

    assert (
        int2numeral(
            111212313415515,
            case="dative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятому"
    )

    assert (
        int2numeral(
            111212313415515,
            case="dative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятій"
    )

    assert (
        int2numeral(
            111212313415515,
            case="dative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятому"
    )

    assert (
        int2numeral(
            111212313415515, case="dative", num_class="ordinal", number="plural"
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятим"
    )

    assert (
        int2numeral(
            111212313415515,
            case="accusative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятий (п’ятнадцятого)"
    )

    assert (
        int2numeral(
            111212313415515,
            case="accusative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцяту"
    )

    assert (
        int2numeral(
            111212313415515,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцяте"
    )

    assert (
        int2numeral(
            111212313415515, case="accusative", num_class="ordinal", number="plural"
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцяті (п’ятнадцятих)"
    )

    assert (
        int2numeral(
            111212313415515,
            case="instrumental",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятим"
    )

    assert (
        int2numeral(
            111212313415515,
            case="instrumental",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятою"
    )

    assert (
        int2numeral(
            111212313415515,
            case="instrumental",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятим"
    )

    assert (
        int2numeral(
            111212313415515, case="instrumental", num_class="ordinal", number="plural"
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятими"
    )

    assert (
        int2numeral(
            111212313415515,
            case="prepositional",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятому (п’ятнадцятім)"
    )

    assert (
        int2numeral(
            111212313415515,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятій"
    )

    assert (
        int2numeral(
            111212313415515,
            case="prepositional",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятому (п’ятнадцятім)"
    )

    assert (
        int2numeral(
            111212313415515, case="prepositional", num_class="ordinal", number="plural"
        )
        == "сто одинадцять трильйонів двісті дванадцять мільярдів триста тринадцять "
        "мільйонів чотириста п’ятнадцять тисяч п’ятсот п’ятнадцятих"
    )

    assert (
        int2numeral(616717818919, case="nominative", num_class="quantitative")
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцять"
    )

    assert (
        int2numeral(616717818919, case="genetive", num_class="quantitative")
        == "шестисот шістнадцяти (шістнадцятьох) мільярдів семисот сімнадцяти "
        "(сімнадцятьох) мільйонів восьмисот вісімнадцяти (вісімнадцятьох) "
        "тисяч дев’ятисот дев’ятнадцяти (дев’ятнадцятьох)"
    )

    assert (
        int2numeral(616717818919, case="dative", num_class="quantitative")
        == "шестистам шістнадцяти (шістнадцятьом) мільярдам семистам сімнадцяти "
        "(сімнадцятьом) мільйонам восьмистам вісімнадцяти (вісімнадцятьом) тисячам "
        "дев’ятистам дев’ятнадцяти (дев’ятнадцятьом)"
    )

    assert (
        int2numeral(616717818919, case="accusative", num_class="quantitative")
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцять (дев’ятнадцятьох)"
    )

    assert (
        int2numeral(616717818919, case="instrumental", num_class="quantitative")
        == "шістьмастами (шістьомастами) шістнадцятьма (шістнадцятьома) мільярдами "
        "сьомастами (сімомастами) сімнадцятьма (сімнадцятьома) мільйонами "
        "вісьмастами (вісьмомастами) вісімнадцятьма (вісімнадцятьома) тисячами "
        "дев’ятьмастами (дев’ятьомастами) дев’ятнадцятьма (дев’ятнадцятьома)"
    )

    assert (
        int2numeral(616717818919, case="prepositional", num_class="quantitative")
        == "шестистах шістнадцяти (шістнадцятьох) мільярдах семистах сімнадцяти "
        "(сімнадцятьох) мільйонах восьмистах вісімнадцяти (вісімнадцятьох) "
        "тисячах дев’ятистах дев’ятнадцяти (дев’ятнадцятьох)"
    )

    assert (
        int2numeral(
            616717818919,
            case="nominative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятий"
    )

    assert (
        int2numeral(
            616717818919,
            case="nominative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцята"
    )

    assert (
        int2numeral(
            616717818919,
            case="nominative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцяте"
    )

    assert (
        int2numeral(
            616717818919, case="nominative", num_class="ordinal", number="plural"
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцяті"
    )

    assert (
        int2numeral(
            616717818919,
            case="genetive",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятого"
    )

    assert (
        int2numeral(
            616717818919,
            case="genetive",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятої"
    )

    assert (
        int2numeral(
            616717818919,
            case="genetive",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятого"
    )

    assert (
        int2numeral(616717818919, case="genetive", num_class="ordinal", number="plural")
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятих"
    )

    assert (
        int2numeral(
            616717818919,
            case="dative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятому"
    )

    assert (
        int2numeral(
            616717818919,
            case="dative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятій"
    )

    assert (
        int2numeral(
            616717818919,
            case="dative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятому"
    )

    assert (
        int2numeral(616717818919, case="dative", num_class="ordinal", number="plural")
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятим"
    )

    assert (
        int2numeral(
            616717818919,
            case="accusative",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятий (дев’ятнадцятого)"
    )

    assert (
        int2numeral(
            616717818919,
            case="accusative",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцяту"
    )

    assert (
        int2numeral(
            616717818919,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцяте"
    )

    assert (
        int2numeral(
            616717818919, case="accusative", num_class="ordinal", number="plural"
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцяті (дев’ятнадцятих)"
    )

    assert (
        int2numeral(
            616717818919,
            case="instrumental",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятим"
    )

    assert (
        int2numeral(
            616717818919,
            case="instrumental",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятою"
    )

    assert (
        int2numeral(
            616717818919,
            case="instrumental",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятим"
    )

    assert (
        int2numeral(
            616717818919, case="instrumental", num_class="ordinal", number="plural"
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятими"
    )

    assert (
        int2numeral(
            616717818919,
            case="prepositional",
            num_class="ordinal",
            gender="masculine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятому (дев’ятнадцятім)"
    )

    assert (
        int2numeral(
            616717818919,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятій"
    )

    assert (
        int2numeral(
            616717818919,
            case="prepositional",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятому (дев’ятнадцятім)"
    )

    assert (
        int2numeral(
            616717818919, case="prepositional", num_class="ordinal", number="plural"
        )
        == "шістсот шістнадцять мільярдів сімсот сімнадцять мільйонів вісімсот "
        "вісімнадцять тисяч дев’ятсот дев’ятнадцятих"
    )

    assert (
        int2numeral(
            1,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "одне (одно)"
    )

    assert (
        int2numeral(
            1,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "однією (одною)"
    )

    assert (
        int2numeral(
            3,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "третій"
    )

    assert (
        int2numeral(
            4,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "четверте"
    )

    assert (
        int2numeral(7, case="instrumental", num_class="quantitative")
        == "сімома (сьома)"
    )

    assert (
        int2numeral(9, case="prepositional", num_class="quantitative")
        == "дев’яти (дев’ятьох)"
    )

    assert (
        int2numeral(13, case="accusative", num_class="ordinal", number="plural")
        == "тринадцяті (тринадцятих)"
    )

    assert (
        int2numeral(
            21,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "двадцять одне (одно)"
    )

    assert (
        int2numeral(
            21,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "двадцятьма (двадцятьома) однією (одною)"
    )

    assert (
        int2numeral(
            23,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "двадцять третій"
    )

    assert (
        int2numeral(
            24,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "двадцять четверте"
    )

    assert (
        int2numeral(27, case="instrumental", num_class="quantitative")
        == "двадцятьма (двадцятьома) сімома (сьома)"
    )

    assert (
        int2numeral(29, case="prepositional", num_class="quantitative")
        == "двадцяти (двадцятьох) дев’яти (дев’ятьох)"
    )

    assert (
        int2numeral(30, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох)"
    )

    assert (
        int2numeral(
            31,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "тридцять одне (одно)"
    )

    assert (
        int2numeral(
            31,
            case="accusative",
            num_class="quantitative",
            gender="masculine",
            number="singular",
        )
        == "тридцять (тридцятьох) один (одного)"
    )

    assert (
        int2numeral(
            31,
            case="accusative",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "тридцять (тридцятьох) одну"
    )

    assert (
        int2numeral(
            31,
            case="accusative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "тридцять (тридцятьох) одне"
    )

    assert (
        int2numeral(31, case="accusative", num_class="quantitative", number="plural")
        == "тридцять (тридцятьох) одні (одних)"
    )

    assert (
        int2numeral(
            31,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "тридцятьма (тридцятьома) однією (одною)"
    )

    assert (
        int2numeral(32, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох) два (двох)"
    )

    assert (
        int2numeral(32, case="accusative", num_class="quantitative", gender="feminine")
        == "тридцять (тридцятьох) дві (двох)"
    )

    assert (
        int2numeral(33, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох) три (трьох)"
    )

    assert (
        int2numeral(
            33,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "тридцять третій"
    )

    assert (
        int2numeral(34, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох) чотири (чотирьох)"
    )

    assert (
        int2numeral(
            34,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "тридцять четверте"
    )

    assert (
        int2numeral(35, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох) п’ять (п’ятьох)"
    )

    assert (
        int2numeral(36, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох) шість (шістьох)"
    )

    assert (
        int2numeral(37, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох) сім (сімох)"
    )

    assert (
        int2numeral(37, case="instrumental", num_class="quantitative")
        == "тридцятьма (тридцятьома) сімома (сьома)"
    )

    assert (
        int2numeral(38, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох) вісім (вісьмох)"
    )

    assert (
        int2numeral(39, case="accusative", num_class="quantitative")
        == "тридцять (тридцятьох) дев’ять (дев’ятьох)"
    )

    assert (
        int2numeral(39, case="prepositional", num_class="quantitative")
        == "тридцяти (тридцятьох) дев’яти (дев’ятьох)"
    )

    assert int2numeral(40, case="accusative", num_class="quantitative") == "сорок"

    assert (
        int2numeral(
            41,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "сорок одне (одно)"
    )

    assert (
        int2numeral(
            41,
            case="accusative",
            num_class="quantitative",
            gender="masculine",
            number="singular",
        )
        == "сорок один (одного)"
    )

    assert (
        int2numeral(
            41,
            case="accusative",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "сорок одну"
    )

    assert (
        int2numeral(
            41,
            case="accusative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "сорок одне"
    )

    assert (
        int2numeral(41, case="accusative", num_class="quantitative", number="plural")
        == "сорок одні (одних)"
    )

    assert (
        int2numeral(
            41,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "сорока однією (одною)"
    )

    assert (
        int2numeral(42, case="accusative", num_class="quantitative")
        == "сорок два (двох)"
    )

    assert (
        int2numeral(42, case="accusative", num_class="quantitative", gender="feminine")
        == "сорок дві (двох)"
    )

    assert (
        int2numeral(43, case="accusative", num_class="quantitative")
        == "сорок три (трьох)"
    )

    assert (
        int2numeral(
            43,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "сорок третій"
    )

    assert (
        int2numeral(44, case="accusative", num_class="quantitative")
        == "сорок чотири (чотирьох)"
    )

    assert (
        int2numeral(
            44,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "сорок четверте"
    )

    assert (
        int2numeral(45, case="accusative", num_class="quantitative")
        == "сорок п’ять (п’ятьох)"
    )

    assert (
        int2numeral(46, case="accusative", num_class="quantitative")
        == "сорок шість (шістьох)"
    )

    assert (
        int2numeral(47, case="accusative", num_class="quantitative")
        == "сорок сім (сімох)"
    )

    assert (
        int2numeral(47, case="instrumental", num_class="quantitative")
        == "сорока сімома (сьома)"
    )

    assert (
        int2numeral(48, case="accusative", num_class="quantitative")
        == "сорок вісім (вісьмох)"
    )

    assert (
        int2numeral(49, case="accusative", num_class="quantitative")
        == "сорок дев’ять (дев’ятьох)"
    )

    assert (
        int2numeral(49, case="prepositional", num_class="quantitative")
        == "сорока дев’яти (дев’ятьох)"
    )

    assert (
        int2numeral(50, case="genetive", num_class="ordinal", number="plural")
        == "п’ятдесятих"
    )

    assert (
        int2numeral(
            51,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "п’ятдесят одне (одно)"
    )

    assert (
        int2numeral(
            51,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "п’ятдесятьма (п’ятдесятьома) однією (одною)"
    )

    assert (
        int2numeral(
            53,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "п’ятдесят третій"
    )

    assert (
        int2numeral(
            54,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "п’ятдесят четверте"
    )

    assert (
        int2numeral(57, case="instrumental", num_class="quantitative")
        == "п’ятдесятьма (п’ятдесятьома) сімома (сьома)"
    )

    assert (
        int2numeral(59, case="prepositional", num_class="quantitative")
        == "п’ятдесяти (п’ятдесятьох) дев’яти (дев’ятьох)"
    )

    assert (
        int2numeral(
            61,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "шістдесят одне (одно)"
    )

    assert (
        int2numeral(
            61,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "шістдесятьма (шістдесятьома) однією (одною)"
    )

    assert (
        int2numeral(
            63,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "шістдесят третій"
    )

    assert (
        int2numeral(
            64,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "шістдесят четверте"
    )

    assert (
        int2numeral(67, case="instrumental", num_class="quantitative")
        == "шістдесятьма (шістдесятьома) сімома (сьома)"
    )

    assert (
        int2numeral(69, case="prepositional", num_class="quantitative")
        == "шістдесяти (шістдесятьох) дев’яти (дев’ятьох)"
    )

    assert (
        int2numeral(
            71,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "сімдесят одне (одно)"
    )

    assert (
        int2numeral(
            71,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "сімдесятьма (сімдесятьома) однією (одною)"
    )

    assert (
        int2numeral(
            73,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "сімдесят третій"
    )

    assert (
        int2numeral(
            74,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "сімдесят четверте"
    )

    assert (
        int2numeral(77, case="instrumental", num_class="quantitative")
        == "сімдесятьма (сімдесятьома) сімома (сьома)"
    )

    assert (
        int2numeral(79, case="prepositional", num_class="quantitative")
        == "сімдесяти (сімдесятьох) дев’яти (дев’ятьох)"
    )

    assert (
        int2numeral(
            81,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "вісімдесят одне (одно)"
    )

    assert (
        int2numeral(
            81,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "вісімдесятьма (вісімдесятьома) однією (одною)"
    )

    assert (
        int2numeral(
            83,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "вісімдесят третій"
    )

    assert (
        int2numeral(
            84,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "вісімдесят четверте"
    )

    assert (
        int2numeral(87, case="instrumental", num_class="quantitative")
        == "вісімдесятьма (вісімдесятьома) сімома (сьома)"
    )

    assert (
        int2numeral(89, case="prepositional", num_class="quantitative")
        == "вісімдесяти (вісімдесятьох) дев’яти (дев’ятьох)"
    )

    assert (
        int2numeral(
            91,
            case="nominative",
            num_class="quantitative",
            gender="neuter",
            number="singular",
        )
        == "дев’яносто одне (одно)"
    )

    assert (
        int2numeral(
            91,
            case="instrumental",
            num_class="quantitative",
            gender="feminine",
            number="singular",
        )
        == "дев’яноста однією (одною)"
    )

    assert (
        int2numeral(
            93,
            case="prepositional",
            num_class="ordinal",
            gender="feminine",
            number="singular",
        )
        == "дев’яносто третій"
    )

    assert (
        int2numeral(
            94,
            case="accusative",
            num_class="ordinal",
            gender="neuter",
            number="singular",
        )
        == "дев’яносто четверте"
    )

    assert (
        int2numeral(97, case="instrumental", num_class="quantitative")
        == "дев’яноста сімома (сьома)"
    )

    assert (
        int2numeral(99, case="prepositional", num_class="quantitative")
        == "дев’яноста дев’яти (дев’ятьох)"
    )
